'''Першого дня спортсмен пробіг `x` кілометрів, а потім він щодня збільшував пробіг на 10% від попереднього

значення. За цим числом `y` визначте номер дня, на який відстань спортсмена складе не менше `y` кілометрів.

Програма отримує на вхід числа `x` та `y` і має вивести одне число - номер дня.'''

def find_day(x, y):
    distance = x
    day = 1

    while distance < y:
        x *= 1.1
        distance += x
        day += 1

    return day

x = float(input("Введіть відстань, яку спортсмен пробіг першого дня: "))
y = float(input("Введіть бажану відстань, яку спортсмен повинен досягнути: "))

result_day = find_day(x, y)
print(f"На {result_day}-й день спортсмен досягне відстані не менше {y} км.")